{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/data/download-model/DeepSeek-R1-0528-Qwen3-8B",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "score",
    "classifier",
    "score",
    "classifier",
    "score"
  ],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k_proj",
    "q_proj"
  ],
  "task_type": "SEQ_CLS",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}